SQL/Active Record II/polls_app/app/models/response.rb

SELECT "responses".* FROM "responses" INNER JOIN "answer_choices" ON "responses"."answer_choice_id" = "answer_choices"."id" WHERE "answer_choices"."question_id" = $1 AND "responses"."id" IS NOT NULL  [["question_id", 1]]
SELECT "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."question_id" WHERE "answer_choices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def sibling_responses
    self.question.responses.where.not(id: self.id)