Rails/Routes and Controllers/cat_api/app/controllers/cats_controller.rb

  def index
    render json: Cat.all
---
SELECT "cats".* FROM "cats"

  def show
    render json: Cat.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # POST /cats
    # { "cat": { "name": "Sally" } }
    cat = Cat.new(name: params[:cat][:name])
    if cat.save
---
INSERT INTO "cats" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sally"], ["created_at", "2019-09-13 03:09:42.484515"], ["updated_at", "2019-09-13 03:09:42.484515"]]